In [1]:
import pandas as pd

In [6]:
df=pd.read_csv('profesi.csv',delimiter='|')
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [20]:
df['occupation'].nunique()

21

In [21]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [25]:
dfUsia=df.groupby([df['occupation'],df['gender']]).describe()
dfUsia=dfUsia['age'][['max','min','mean']]
dfUsia.rename(columns={'max':'max_usia','min':'min_usia','mean':'rerata_usia'},inplace=True)
dfUsia

                      max_usia  min_usia  rerata_usia
occupation    gender
administrator F           62.0      22.0    40.638889
              M           70.0      21.0    37.162791
artist        F           48.0      19.0    30.307692
              M           45.0      20.0    32.333333
doctor        M           64.0      28.0    43.571429
educator      F           51.0      23.0    39.115385
              M           63.0      25.0    43.101449
engineer      F           36.0      23.0    29.500000
              M           70.0      22.0    36.600000
entertainment F           38.0      24.0    31.000000
              M           50.0      15.0    29.000000
executive     F           49.0      39.0    44.000000
              M           69.0      22.0    38.172414
healthcare    F           53.0      22.0    39.818182
              M           62.0      28.0    45.400000
homemaker     F           50.0      20.0    34.166667
              M           23.0      23.0    23.000000
lawyer        F           51.0      28.0    39.500000
              M           53.0      21.0    36.200000
librarian     F           59.0      26.0    40.000000
              M           69.0      23.0    40.000000
marketing     F           50.0      24.0    37.200000
              M           55.0      24.0    37.875000
none          F           55.0      26.0    36.500000
              M           33.0      11.0    18.600000
other         F           55.0      18.0    35.472222
              M           64.0      13.0    34.028986
programmer    F           38.0      26.0    32.166667
              M           63.0      20.0    33.216667
retired       F           70.0      70.0    70.000000
              M           73.0      51.0    62.538462
salesman      F           33.0      18.0    27.000000
              M           66.0      21.0    38.555556
scientist     F           31.0      26.0    28.333333
              M           55.0      23.0    36.321429
student       F           38.0      13.0    20.750000
              M           42.0       7.0    22.669118
technician    F           38.0      38.0    38.000000
              M           55.0      21.0    32.961538
writer        F           56.0      18.0    37.631579
              M           60.0      21.0    35.346154

In [26]:
dfGender=pd.crosstab(df.occupation, df.gender).apply(lambda r: r/r.sum(), axis=1) * 100
dfGender['%total']=dfGender['F']+dfGender['M']
dfGender.rename(columns={'F':'%female','M':'%male'},inplace=True)
dfGender=dfGender[['%male','%female','%total']]
dfGender

gender              %male    %female  %total
occupation
administrator   54.430380  45.569620   100.0
artist          53.571429  46.428571   100.0
doctor         100.000000   0.000000   100.0
educator        72.631579  27.368421   100.0
engineer        97.014925   2.985075   100.0
entertainment   88.888889  11.111111   100.0
executive       90.625000   9.375000   100.0
healthcare      31.250000  68.750000   100.0
homemaker       14.285714  85.714286   100.0
lawyer          83.333333  16.666667   100.0
librarian       43.137255  56.862745   100.0
marketing       61.538462  38.461538   100.0
none            55.555556  44.444444   100.0
other           65.714286  34.285714   100.0
programmer      90.909091   9.090909   100.0
retired         92.857143   7.142857   100.0
salesman        75.000000  25.000000   100.0
scientist       90.322581   9.677419   100.0
student         69.387755  30.612245   100.0
technician      96.296296   3.703704   100.0
writer          57.777778  42.222222   100.0